# Mid Test : Titanic Dataset
### Topik Zulkarnain
***
Background : The dataset contains data for 887 of the real Titanic passengers. Each row represents one person. The columns describe different attributes about the person including whether they survived (S), their age (A), their passenger-class (C), their sex (G) and the fare they paid (X). The table below shows the Data Dictionary.

Objective : Create a python script that contains the script to answer the questions below. Please put comments on the script to show which line of codes answers which questions. Please upload the script after you finish.

Questions :

1. What is the dimension (col, row) of the data frame?
2. How to know data type of each variable?
3. How many passengers survived (Survived=1) and not-survived (Survived=0)?
4. How to drop column ‘Name’ from the data frame?
5. Add one new column called ‘family’ to represent number of family-member aboard (hint: family = sibsp + parch)
6. As shown, columns ‘Age’ contains missing values. Please add new column named ‘Age_miss’ to indicate whether Age is missing or not (Age_miss = ‘YES’ for missing value and ‘NO’ for non-missing value). 
7. Please fill Age missing value with means of existing Age values
8. What is the maximum passenger Age who survived from the tragedy? 
9. How many passengers survived from each ‘PClass’? 
10. How to randomly split the data frame into 2 parts (titanic1 and titanic2) with proportion of 0.7 for tttanic1 and 0.3 for titanic2 ?

## Solutions 
***

### 1. Find the dimension of the data frame using python function

In [3]:
#import data using pandas
import pandas as pd
df = pd.read_csv('titanic.csv')
#using shape to print dimension of data
df.shape

(887, 8)

### 2. Knowing data type of each variable using info()

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 887 entries, 0 to 886
Data columns (total 8 columns):
Survived                   887 non-null int64
Pclass                     887 non-null int64
Name                       887 non-null object
Sex                        887 non-null object
Age                        887 non-null float64
Siblings/Spouses Aboard    887 non-null int64
Parents/Children Aboard    887 non-null int64
Fare                       887 non-null float64
dtypes: float64(2), int64(4), object(2)
memory usage: 55.5+ KB

### 3. Count survival and non-survival passengers

In [13]:
#Count survived passenger
df_survived = df[df['Survived']==1]
print(df_survived[['Survived']].count())

#Count Not Survived passenger
df_not_survived = df[df['Survived']==0]
df_not_survived = df_not_survived.rename(columns={"Survived": "Not Survived"})
print(df_not_survived[['Not Survived']].count())

Survived    342
dtype: int64
Not Survived    545
dtype: int64

### 4. Drop columns 'Name' from dataframe by using drop

In [14]:
df_without_name = df.drop(columns = ['Name'])
df_without_name.head()

,Survived,Pclass,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
0,0,3,male,22.0,1,0,7.2500
1,1,1,female,38.0,1,0,71.2833
2,1,3,female,26.0,0,0,7.9250
3,1,1,female,35.0,1,0,53.1000
4,0,3,male,35.0,0,0,8.0500

### 5. Adding one new column 'familiy' for dataframe which is the sum of Siblings/Spouses Aboard and Parents/Children Aboard

In [19]:
df['family'] = df['Siblings/Spouses Aboard'] + df['Parents/Children Aboard']
df.head()

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare,family
0,0,3,Mr. Owen Harris Braund,male,22.0,1,0,7.2500,1
1,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,38.0,1,0,71.2833,1
2,1,3,Miss. Laina Heikkinen,female,26.0,0,0,7.9250,0
3,1,1,Mrs. Jacques Heath (Lily May Peel) Futrelle,female,35.0,1,0,53.1000,1
4,0,3,Mr. William Henry Allen,male,35.0,0,0,8.0500,0

### 6. Adding one new column 'Age_Miss' for dataframe to indicating wether the age column is missing or not

In [ ]:
Age_miss = []
for i in range(len(df['Age'])):
    if df['Age'][i].isnull():
        Age_miss.append('YES')
    else :
        Age_miss.append('NO')

### 7. Fill missing value in Age feature with descriptive statistics

In [52]:
df['Age'] = df['Age'].fillna(df['Age'].mean())

### 8. Finding the oldest survivor from titanci tragedy

In [60]:
df_survived[['Age']].max()

Age    80.0
dtype: float64

### 9. Count number of the survivor from each Pclass

In [20]:
#IX passenger survived from each PClass
df_survived_class = df_survived[['Survived','Pclass']]
df_survived_class.groupby(['Pclass']).count()

        Survived
Pclass
1            136
2             87
3            119

### 10. Randomly split dataset into two parts with but different proportion

In [22]:
#proportion for titanic 1 is 70% and titanic 2 for the rest
from sklearn.model_selection import train_test_split

titanic1, titanic2 = train_test_split(df, test_size=0.2)

In [23]:
print(titanic1.count())
print(titanic2.count())

Survived                   709
Pclass                     709
Name                       709
Sex                        709
Age                        709
Siblings/Spouses Aboard    709
Parents/Children Aboard    709
Fare                       709
family                     709
dtype: int64
Survived                   178
Pclass                     178
Name                       178
Sex                        178
Age                        178
Siblings/Spouses Aboard    178
Parents/Children Aboard    178
Fare                       178
family                     178
dtype: int64